{
    "name": "Mahendra Gehlot",
    "profile": "Comprehensive Data Science Profile",
    "education": [
      {
        "degree": "Master of Technology",
        "institution": "Indian Institute of Science",
        "duration": "August 2021 – June 2023",
        "courses": [
          "DS 211: Numerical Optimization",
          "DS 284: Linear Algebra",
          "DS 226: Introduction to Computing for AI & Machine Learning",
          "DS 261: Artificial Intelligence for Medical Image Analysis",
          "AE 205: Navigation, Guidance, and Control",
          "AE 274: Topics in Neural Computation"
        ],
        "project": {
          "title": "Development of Efficient Mask R-CNN for Mines-Like Object Detection and Segmentation",
          "overview": "Addressed maritime mine detection using sonar imaging by designing an efficient instance segmentation pipeline.",
          "key_innovations": [
            "Robust Object Detection using a modified Mask R-CNN architecture with RoIAlign, Feature Pyramid Networks, and a ResNet50 backbone.",
            "Synthetic Data Generation using denoising diffusion probabilistic models (DDPM) to augment sonar imagery and mitigate data scarcity.",
            "Comparative Analysis employing metrics like mAP and recall to evaluate the impact of synthetic data on detection performance."
          ],
          "technologies": [
            "Python",
            "PyTorch",
            "MMDetection",
            "Detectron2"
          ]
        }
      },
      {
        "degree": "Bachelor of Technology",
        "institution": "Rajasthan Technical University",
        "duration": "August 2015 – May 2019",
        "focus": "Engineering and Programming in MATLAB, Python, and C++",
        "projects": [
          "Linear Least Squares (SIR Model of COVID-19)",
          "Cholesky Decomposition",
          "Steepest Descent Method",
          "Newton's Method",
          "Conjugate Gradient Method",
          "Revised Simplex Method",
          "Quadratic Programming"
        ]
      }
    ],
    "professional_experience": [
      {
        "title": "Data Scientist",
        "organization": "Mercedes‑Benz Research and Development India",
        "duration": "August 2023 – Present",
        "projects": [
          {
            "title": "EV Charging Optimization Using Context-Aware LSTM",
            "challenge": "Overcome limitations of conventional charging strategies that rely solely on instantaneous state-of-charge and battery temperature.",
            "solution": "Developed a predictive framework incorporating an LSTM network enhanced with an attention encoding mechanism, leveraging contextual inputs (battery SoC, ambient conditions, and user-defined goals) to generate optimal charging profiles.",
            "performance": {
              "RMSE": "4.2%",
              "charging_time_reduction": "0.2-3%",
              "efficiency_improvement": "up to 15%",
              "range_improvement": "up to 25 km"
            }
          },
          {
            "title": "Optimizing Test Bench Procedures with Machine Learning",
            "challenge": "Enhance traditional test bench processes to predict potential field failures and improve system performance.",
            "solution": "Integrated tree-based models (Random Forest, Gradient Boosting, Decision Trees) with large-scale data processing in Databricks, and implemented SHAP for model interpretability to identify high-impact warranty issues.",
            "impact": "Identified warranty issues valued at €20 million and reduced overall warranty costs by approximately 10%."
          },
          {
            "title": "MLOps Infrastructure for Fleet-Level Energy Efficiency",
            "challenge": "Monitor and optimize energy efficiency across a fleet of over 300,000 PHEV vehicles while ensuring compliance with emissions standards.",
            "solution": "Built an end-to-end MLOps ecosystem using Databricks and MLflow for experiment tracking, coupled with Azure Kubernetes Service for scalable model deployment, automated data pipelines, and retraining triggers.",
            "impact": "Enabled robust compliance monitoring and optimized resource utilization, directly supporting regulatory requirements."
          },
          {
            "title": "RAG-Based LLM Application for Regulatory & Legal Information Retrieval",
            "challenge": "Streamline the retrieval and synthesis of complex regulatory and legal documentation.",
            "solution": "Developed a retrieval-augmented generation system that combines a fine-tuned large language model with a vector store for dense document embeddings, employing hybrid retrieval methods and custom prompt engineering.",
            "impact": "Enhanced operational efficiency and regulatory compliance by reducing research time and providing clear, actionable insights."
          }
        ]
      },
      {
        "title": "Data Science Intern",
        "organization": "Gojek Tech",
        "duration": "May 2022 – July 2022",
        "projects": [
          {
            "title": "NLP Data Science Internship",
            "overview": "Worked on a comprehensive NLP project to enhance chatbot capabilities by analyzing Indonesian language customer support and social media data.",
            "data_extraction": "Utilized BigQuery to extract conversation logs and social media data, implementing complex SQL queries and data sampling strategies to ensure representative datasets.",
            "exploratory_data_analysis": "Conducted statistical and visual analyses of conversation patterns, message lengths, and frequency of key phrases.",
            "nlp_labeling": "Implemented weak supervision frameworks (e.g., Snorkel) and clustering techniques (K-means, embedding-based clustering) to label Indonesian utterances for intent recognition.",
            "model_exploration": "Explored classical NLP techniques (NLTK, SpaCy) and transformer-based models (BERT, RoBERTa) alongside sequence models (LSTMs, GRUs) to improve intent detection.",
            "deployment": "Tracked experiments using MLflow, integrated with Gojek’s in-house tool Merlin, and deployed interactive dashboards with Streamlit for performance monitoring."
          }
        ]
      },
      {
        "title": "Analyst",
        "organization": "HiTech iSolutions LLP",
        "duration": "March 2020 – July 2021",
        "projects": [
          {
            "title": "Aeronautical Data Management and Digital Mapping",
            "overview": "Managed and compiled critical aerodrome data from global Aeronautical Information Publications (AIPs) to support aviation safety and operational efficiency.",
            "aeronautical_data_management": {
              "AIP_analysis": "Extracted and verified detailed data from AIPs, interpreted specialized aviation notations, and maintained up-to-date records in a complex, multi-source environment.",
              "static_dynamic_integration": "Categorized static elements (runway dimensions, taxiway configurations) and tracked dynamic changes (NOTAMs, seasonal updates).",
              "database_management": "Designed and maintained a database of approximately 28,000 aerodromes with optimized schemas and indexing strategies for efficient retrieval."
            },
            "digital_mapping": "Developed digital airport maps using satellite imagery and geospatial analysis, ensuring adherence to ICAO standards and high positional accuracy.",
            "process_automation": "Automated repetitive data extraction and validation processes, achieving a consistent 15% quarter-over-quarter improvement in operational efficiency."
          }
        ]
      }
    ],
    "certifications": {
      "machine_learning": {
        "course": "Machine Learning with Python-From Linear Models to Deep Learning",
        "institution": "MITx",
        "skills": [
          "Statistical foundations",
          "Linear regression and classification",
          "Feature engineering and selection",
          "Model evaluation and validation",
          "Regularization techniques"
        ]
      },
      "cloud_data_science": {
        "course": "Practical Data Science on the AWS Cloud",
        "skills": [
          "Cloud-based data processing workflows",
          "AWS tools (e.g., SageMaker)",
          "Scalable data storage and retrieval",
          "Model deployment to production",
          "Cost optimization and resource management"
        ]
      },
      "big_data": {
        "course": "Scalable Machine Learning on Big Data using Apache Spark",
        "skills": [
          "Distributed computing concepts",
          "Spark architecture and programming paradigms",
          "Processing and analyzing massive datasets",
          "Parallel computation strategies",
          "Performance optimization"
        ]
      },
      "deep_learning": {
        "courses": [
          "Deep Learning AI TensorFlow Developer",
          "Neural Networks and Deep Learning"
        ],
        "skills": [
          "Neural network architecture design",
          "Deep learning model training and optimization",
          "TensorFlow framework proficiency",
          "Transfer learning approaches",
          "CNNs, RNNs, LSTMs",
          "Hyperparameter tuning"
        ]
      }
    },
    "credentials": {
      "GATE": "Secured All India Rank 03 in GATE 2020",
      "academic_scholarships": "Awarded Academic Excellence Scholarships",
      "gold_medal": "Gold Medalist in B.Tech (Highest CGPA)"
    },
    "patent": {
      "title": "Electric Vehicle Charging Score Generation using Field Cars and Endurance Cars with Car Specific Embedding and LSTM",
      "overview": "A novel, data-driven approach for optimizing EV charging by generating a dynamic charging score based on vehicle-specific data and sequential modeling.",
      "technical_competencies": {
        "time_series_analysis": "Utilizes LSTM networks to handle sequential EV charging data, incorporating gating mechanisms and backpropagation through time (BPTT).",
        "feature_engineering": "Implements car-specific embedding to transform raw vehicle attributes into dense vector representations.",
        "data_management": "Integrates data from Field Cars and Endurance Cars with robust data acquisition, cleaning, and storage techniques.",
        "model_training": "Employs appropriate loss functions, cross-validation, and performance metrics to train and evaluate the predictive model.",
        "domain_expertise": "Demonstrates in-depth knowledge of EV battery technology, charging principles, and factors influencing charging behavior."
      },
      "strengths": [
        "Novel combination of car-specific embeddings and LSTM",
        "Practical applicability in optimizing EV charging efficiency",
        "Scalability to large datasets and real-time predictions",
        "Customization for individual car profiles"
      ],
      "considerations": [
        "Ensuring data privacy and compliance with regulations (GDPR, CCPA)",
        "Improving model explainability using techniques like SHAP or LIME",
        "Meeting real-time performance requirements for on-device deployment",
        "Handling data variance between Field Cars and Endurance Cars",
        "Establishing effective model retraining protocols"
      ]
    },
    "summary": "Mahendra Gehlot is a highly skilled data scientist with advanced expertise in machine learning, deep learning, time series analysis, and large-scale data processing. His academic background, extensive professional experience, and robust certification record have equipped him with the ability to design, develop, and deploy innovative data-driven solutions across automotive research, NLP-driven customer engagement, and aeronautical data management. His patented work in EV charging optimization further underscores his innovative approach and domain expertise in electric vehicle technology."
  }
  